

// {{ Штраус Ю.В. - Программный интерфейс,  согласованная скидка и кнопка перерасчета, реквизит контактное лицо

#Область ПрограммныйИнтерфейс

// Процедура динамически добавляет элементы на формы документов
//
// Параметры:
//   Форма - Форма-объект создаваемого документа.
//
Процедура ДополнитьФорму(Форма) Экспорт
	
	ИмяФормы = Форма.ИмяФормы;
	
	Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
		
	ИначеЕсли ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
		
	ИначеЕсли ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
		
	ИначеЕсли ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда
		ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма);
		
	ИначеЕсли ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда
		ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма)
	
	// чтобы поле не создалось повторно, если форму открывают несколько раз
	Если Форма.Элементы.Найти("КонтактноеЛицо") <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// в правую колонку шапки документа контактное лицо
	ПолеВвода = Форма.Элементы.Добавить("КонтактноеЛицо", Тип("ПолеФормы"), Форма.Элементы.ГруппаШапкаПраво);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	
	ПолеВвода.ПутьКДанным = "Объект.КонтактноеЛицо";
	ПолеВвода.Заголовок = "Контактное лицо";    
	
	МассивСвязей = Новый Массив;
	НоваяСвязь = Новый СвязьПараметраВыбора("Отбор.Владелец", "Объект.Контрагент");
	МассивСвязей.Добавить(НоваяСвязь);
	ПолеВвода.СвязиПараметровВыбора = Новый ФиксированныйМассив(МассивСвязей);

	

КонецПроцедуры

// Вставляет поле контактного лица перед полем суммы документа.
//
// Параметры:
//   Форма - РасширениеУправляемойФормыДляДинамическогоСписка - Форма документа.
//
Процедура ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма)
	
	Если Форма.Элементы.Найти("КонтактноеЛицо") <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	//  на форму перед элементом СуммаДокумента и после договора
	ПолеВвода = Форма.Элементы.Вставить("КонтактноеЛицо", Тип("ПолеФормы"), , Форма.Элементы.СуммаДокумента);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.КонтактноеЛицо";
	ПолеВвода.Заголовок = "Контактное лицо"; 
	
	МассивСвязей = Новый Массив;
	НоваяСвязь = Новый СвязьПараметраВыбора("Отбор.Владелец", "Объект.Контрагент");
	МассивСвязей.Добавить(НоваяСвязь);
	ПолеВвода.СвязиПараметровВыбора = Новый ФиксированныйМассив(МассивСвязей);

КонецПроцедуры



#КонецОбласти
