

// {{ Штраус Ю.В. - Программный интерфейс,  согласованная скидка и кнопка перерасчета, реквизит контактное лицо

#Область ПрограммныйИнтерфейс

// Процедура динамически добавляет элементы на формы документов
//
// Параметры:
//   Форма - Форма-объект создаваемого документа.
//
Процедура ДополнитьФорму(Форма) Экспорт
	
	ИмяФормы = Форма.ИмяФормы;
	
	Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
		
	ИначеЕсли ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
		
	ИначеЕсли ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
		
	ИначеЕсли ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда
		ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма);
		
	ИначеЕсли ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда
		ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма);
		
	КонецЕсли;
	
	Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда
		
		// 1.горизонтальная группа для размещения слева
		Если Форма.Элементы.Найти("ГруппаСкидкиСлева") = Неопределено Тогда
			ЛеваяШапка = Форма.Элементы.Найти("ГруппаШапкаЛево");
			Если ЛеваяШапка = Неопределено Тогда
				ЛеваяШапка = Форма.Элементы.ГруппаШапка;
			КонецЕсли;
			
			НоваяГруппа = Форма.Элементы.Добавить("ГруппаСкидкиСлева", Тип("ГруппаФормы"), ЛеваяШапка);
			НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно;
			НоваяГруппа.ОтображатьЗаголовок = Ложь;
		КонецЕсли;
		
		РодительскаяГруппа = Форма.Элементы.ГруппаСкидкиСлева;
		
		// 2."Согласованная скидка" внутрь этой группы
		Если Форма.Элементы.Найти("СогласованнаяСкидка") = Неопределено Тогда
			НовоеПоле = Форма.Элементы.Добавить("СогласованнаяСкидка", Тип("ПолеФормы"), РодительскаяГруппа);
			НовоеПоле.Вид = ВидПоляФормы.ПолеВвода;
			НовоеПоле.ПутьКДанным = "Объект.СогласованнаяСкидка";
			НовоеПоле.Заголовок = "Согласованная скидка";
			НовоеПоле.Ширина = 8;
			НовоеПоле.УстановитьДействие("ПриИзменении", "СогласованнаяСкидкаПриИзменении");
		КонецЕсли;
		
		// 3. кнопка пересчета в эту же группу
		Если Форма.Элементы.Найти("КнопкаПересчета") = Неопределено Тогда
			НоваяКоманда = Форма.Команды.Добавить("ПересчитатьПоСкидке");
			НоваяКоманда.Заголовок = "Пересчитать таблицу";
			НоваяКоманда.Действие = "КомандаПересчитатьПоСкидке";
			
			НоваяКнопка = Форма.Элементы.Добавить("КнопкаПересчета", Тип("КнопкаФормы"), РодительскаяГруппа);
			НоваяКнопка.ИмяКоманды = "ПересчитатьПоСкидке";
		КонецЕсли;
		
	КонецЕсли;
	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма)
	
	// чтобы поле не создалось повторно, если форму открывают несколько раз
	Если Форма.Элементы.Найти("КонтактноеЛицо") <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// в правую колонку шапки документа контактное лицо
	ПолеВвода = Форма.Элементы.Добавить("КонтактноеЛицо", Тип("ПолеФормы"), Форма.Элементы.ГруппаШапкаПраво);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	
	ПолеВвода.ПутьКДанным = "Объект.КонтактноеЛицо";
	ПолеВвода.Заголовок = "Контактное лицо";    
	
	МассивСвязей = Новый Массив;
	НоваяСвязь = Новый СвязьПараметраВыбора("Отбор.Владелец", "Объект.Контрагент");
	МассивСвязей.Добавить(НоваяСвязь);
	ПолеВвода.СвязиПараметровВыбора = Новый ФиксированныйМассив(МассивСвязей);

	

КонецПроцедуры

// Вставляет поле контактного лица перед полем суммы документа.
//
// Параметры:
//   Форма - РасширениеУправляемойФормыДляДинамическогоСписка - Форма документа.
//
Процедура ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма)
	
	Если Форма.Элементы.Найти("КонтактноеЛицо") <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	//  на форму перед элементом СуммаДокумента и после договора
	ПолеВвода = Форма.Элементы.Вставить("КонтактноеЛицо", Тип("ПолеФормы"), , Форма.Элементы.СуммаДокумента);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.КонтактноеЛицо";
	ПолеВвода.Заголовок = "Контактное лицо"; 
	
	МассивСвязей = Новый Массив;
	НоваяСвязь = Новый СвязьПараметраВыбора("Отбор.Владелец", "Объект.Контрагент");
	МассивСвязей.Добавить(НоваяСвязь);
	ПолеВвода.СвязиПараметровВыбора = Новый ФиксированныйМассив(МассивСвязей);

КонецПроцедуры



#КонецОбласти
